Repository: 84000/data-translation-memory
Catalog: toh703-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སེང་གེ་སྒྲའི་གཟུངས་ཞེས་བྱ་བ།
en: The Dhāraṇī of Noble Avalokiteśvara Siṃhanāda

source: བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཆང་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to blessed Vajradhara.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཕོ་བྲང་རི་པོ་ཊ་ལའི་རྩེ་མོ་ན།
en: The Blessed One was residing at the noble Lord Avalokiteśvara’s palace at the summit of Mount Potala.

source: རིན་པོ་ཆེའི་ཁང་བཟངས་རིན་པོ་ཆེ་དང་། མུ་ཏིག་དང་། ནོར་བུ་དཔག་མེད་ཀྱིས་སྤྲས་པ། འོད་ཀྱིས་སྟོང་གསུམ་ཁྱབ་པ།
en: That bejeweled palace was ornamented with countless jewels, pearls, and gems, the light of which filled the trichiliocosm.

source: མེ་ཏོག་དྲི་ཞིམ་པོ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་བརྒྱན་པའི་ས་ཕྱོགས་དེ་ན་བྱམས་པ་ལ་སོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་པ་དང་། ཉན་ཐོས་ཆེན་པོ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་སོགས་པ་དགེ་སློང་རབ་ཏུ་མང་པོས་ཡོངས་སུ་བསྐོར་ཞིང་། བཅོམ་ལྡན་འདས་སེང་གེའི་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: In that region filled with the delightful scent of all kinds of flowers, the Blessed One was seated on a lion throne that had been arranged for him, surrounded by countless bodhisattvas led by Maitreya, as well as many monks led by the great śrāvaka Śāradvatīputra.

source: འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་ཞེས་བྱ་བ་འདུག་སྟེ། འདུག་པར་གྱུར་པ་དེ་རང་གི་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: In that assembly was the bodhisattva great being Mañjuśrī, who rose from his seat, draped his upper robe over one shoulder, knelt on his right knee, and prostrated his head at the Blessed One’s feet.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཡུལ་མ་ག་དྷཱ་ན་རྒྱལ་པོ་དབང་ཕྱུག་འོད་ཅེས་བགྱི་བ་འཁོར་དང་བཙུན་མོ་དང་། ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་ལས་རྒྱལ་པོ་དེ་མཛེ་དང་། ཕོལ་མིག་དང་།
en: He said to the Blessed One, “Blessed One, in the land of Magadha there is a king named Lord of Light who has an excellent retinue, queens, and abundant wealth.

source: དབུགས་མི་བདེ་བ་སྙིང་ནད་འབར་བ་བྱུང་སྟེ་དེ་ཇི་ལྟར་བསལ་བར་བགྱི།
en: But beyond this, the king is afflicted with leprosy, boils, difficulty breathing, and heart disease. How can he be healed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་སྔོན་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་ལ་འཇམ་དཔལ་ཁྱེད་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཆེན་པོ་ཞེས་བྱ་བ་ཡིན་ལ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སེང་གེ་སྒྲ་འདི་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེའི་མཆོག་ཅེས་བྱ་བ་ཡིན་པས།
en: The Blessed One replied, “Bodhisattva great being Mañjuśrī, long ago in this very world you, Mañjuśrī, were a bodhisattva called Great Wisdom, and noble Avalokiteśvara Siṃhanāda was a bodhisattva called Supreme Compassion.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་སྟོང་གསུམ་དུ་སེམས་ཅན་གྱི་དོན་ལ་གཤེགས་པ་ལ་སེང་གེ་དཀར་པོ་ཅིག་དབང་དུ་བསྡུས་ཏེ་ཆིབས་པ་བྱས།
en: Those two bodhisattvas tamed a white lion, mounted it, and rode out to help beings of the trichiliocosm.

source: སྐུ་ལ་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན། མདུང་རྩེ་གསུམ་པ་དང་། རལ་གྲི་དང་། པདྨ་དང་།
en: They set out adorned with precious adornments and holding a trident, sword, lotus, and an utpala flower.

source: ཨུཏྤལ་ཐོགས་ནས་ཕྱིན་པ་ལ། རྒྱ་མཚོ་ཆེན་པོ་ལས་རྒལ་བའི་དུས་སུ་སེང་གེ་བཞག་ནས་ཁུར་རེས་བྱས་ཤིང་བྱོན་པ་ལ།
en: But when the time came to cross the great ocean, they left the lion behind, shared the load, and continued onward.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཆེན་པོ་ཁྱོད་ཉིད་ནི་གྲོགས་ལ་ཕན་པའི་སེམས་ཀྱིས་རང་གི་རལ་གྲིས་རང་བཀུམ་མོ། །
en: You, the bodhisattva Great Wisdom, thinking to benefit your friend, took your own life with your sword.

source: བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་མཆོག་གི་བསམ་པ་ལ་སྟེང་འོག་བར་སྣང་གི་ཀླུ་དང་ལྷ་ལ་སོགས་པས་བསད་དམ་སྙམ་ནས་བཏུང་བའི་སྣོད་བྲམ་ཟེའི་ཐོད་པ་ལག་ན་ཐོགས།
en: But the bodhisattva Supreme Compassion thought that you had been killed by the nāgas, gods, and the like, who dwell in the heavens, below the earth, and in the sky.

source: ཏྲི་ཤཱུ་ལ་རྩེ་གསུམ་པ་ལག་ན་ཐོགས། སེང་གེ་དཀར་པོ་ལ་ཞོན།
en: He then took up a brahmin’s skull as a drinking vessel, took his trident in his hand, and mounted the white lion.

source: མྱ་ངན་དུ་རལ་པ་ཐོད་དུ་བཅིངས་ནས་སྟེང་གི་ལྷ་ལ་བསྡིགས་ཏེ།
en: In sorrow, he bound his locks upon his crown.

source: སྙིང་རྗེའི་སྟོབས་ཀྱིས་སེམས་ཅན་དོན་བྱས་པས། །རང་གི་གྲོགས་པོས་སྤངས་ནས་གཅིག་པུ་ལུས། །
en: “He threatened the gods above while brandishing his trident at them, and said, “‘Moved by compassion we set out to help beings, But I was abandoned by my friend and left behind alone.

source: ལྷ་རྣམས་ཀུན་གྱིས་ཉེས་ན་ཆད་པའི་ལས། །
en: If this is the fault of all the gods, I will punish them.

source: གྲོང་ཁྱེར་འཇོམས་ཤིང་ལྷ་རྣམས་འགུམས་པར་བགྱིད། །ཅེས་སྨྲས་ཏེ།
en: I will destroy their towns and kill the gods!’

source: ལྷ་རྣམས་ལ་ཏྲི་ཤཱུ་ལ་གདེངས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཁམས་གསུམ་གྱི་ལྷ་དགའ་བའི་མདངས་ཕྱུང་སྟེ།
en: “The Four Great Kings, Śakra, lord of the gods, Brahmā, lord of the Sahā world, and the gods of the three worlds beamed with joy.

source: ལྷའི་མེ་ཏོག་པདྨ་དང་། ཀུ་མུ་ད་དང་། པུཎྜ་རཱི་ཀ་དང་། ཙམ་པ་ཀ་ལ་སོགས་པ་ཕུལ་ཏེ་ཐོད་པ་བཀང་ངོ་། །དེ་ནས་བར་སྣང་གི་ལྷ་དང་། ཀླུ་དང་། དྲི་ཟ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། གྲུལ་བུམ་དང་།
en: They offered divine lotuses, kumuda flowers, white lotuses, campaka flowers, and the like, filling his skull cup.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་ལ་སོགས་པ་ལ་བསྡིགས་པ། ཏྲི་ཤཱུ་ལ་གདེངས་ནས། སྙིང་རྗེའི་སྟོབས་ཀྱིས་སེམས་ཅན་དོན་བྱས་པས། །རང་གི་གྲོགས་པོས་སྤངས་ནས་གཅིག་པུ་ལུས། །
en: “He next threatened the gods of the sky, nāgas, gandharvas, yakṣas, asuras, kumbhāṇḍa, garuḍas, and kinnaras, brandished his trident, and said, “‘Moved by compassion we set out to help beings, But I was abandoned by my friend and left behind alone.

source: སྡེ་བརྒྱད་ཚོགས་ཀྱིས་ཉེས་ན་ཆད་པའི་ལས། །གྲོང་ཁྱེར་འཇོམས་ཞིང་སྡེ་བརྒྱད་འགུམས་པར་བགྱིད། །ཅེས་སྨྲས་ཏེ།
en: If this is the fault of the eight classes, I will punish them By destroying their towns and killing the eight classes!’

source: སྡེ་བརྒྱད་ལ་ཏྲི་ཤཱུ་ལ་གདེངས་པ་དང་། ཀླུའི་རྒྱལ་པོ་གཙུག་ན་རིན་ཆེན་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཟུར་ཕུད་ལྔ་མ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་།
en: “He then brandished his trident at the eight classes.

source: ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ཐགས་བཟངས་རིས་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་རྟ་མགོ་ཅན་དང་། གྲུལ་བུམ་གྱི་རྒྱལ་པོ་སྦྲུལ་མགོ་དགུ་པ་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་གསེར་མིག་ཅན་ལ་སོགས་པ་འཁོར་མང་པོ་དང་བཅས་པ་དགའ་བའི་མདངས་ཕྱུང་སྟེ། སེང་གེ་ལ་རིན་པོ་ཆེའི་རྒྱན་ཕུལ་ལོ། །
en: The nāga king Jeweled Crown, the gandharva king Pañcaśikha, the yakṣa king Vaiśravaṇa, the asura king Vemacitrin, the horse-headed kinnara king Druma, the kumbhāṇḍa king Nine-Headed Snake, the garuḍa king Golden Eyes, and the rest, together with their large retinues, beamed with joy and offered jeweled ornaments to the lion.

source: དེ་ནས་སའི་འོག་ན་གནས་པའི་ཀླུ་ལ་བསྡིགས་ཏེ། སྙིང་རྗེའི་སྟོབས་ཀྱིས་སེམས་ཅན་དོན་བྱས་པས། །རང་གི་གྲོགས་པོས་སྤངས་ནས་གཅིག་པུ་ལུས། །
en: “He next threatened the nāgas who live below the earth, saying, “‘Moved by compassion we set out to help beings, But I was abandoned by my friend and left behind alone.

source: ཀླུ་ཚོགས་རྣམས་ཀྱིས་ཉེས་ན་ཆད་པའི་ལས། །གྲོང་ཁྱེར་འཇོམས་ཤིང་ཀླུ་རྣམས་འགུམས་པར་བགྱིད། །ཅེས་སྨྲས་ཏེ།
en: If this is the fault of the nāgas, I will punish them By destroying their towns and killing the nāgas!’

source: རྒྱ་མཚོ་ཆེན་པོ་ཏྲི་ཤཱུ་ལས་དཀྲུགས་པ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་བ་རུ་ཎ་དང་།
en: “He then stirred the great ocean with his trident.

source: ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་དང་། དེ་དག་ལ་སོགས་པ་རྫུ་འཕྲུལ་དང་ལྡན་པ། འོད་དང་ལྡན་པ། ལྷ་དང་ལྷ་མ་ཡིན་གྱི་གཡུལ་མྱོང་བར་བྱེད་པ། ཀླུའི་རྒྱལ་པོ་འབུམ་ཕྲག་དྲུག་གཡོག་དང་འཁོར་དུ་བཅས་པ་འདུས་ཏེ།
en: The nāga king Anavatapta, the nāga king Varuṇa, the nāga king Takṣaka, and the other six hundred thousand nāga kings, and their servants and retinues, who have miraculous powers, are radiant, and who cause the gods and asuras to battle all gathered together, beamed with joy.

source: དགའ་བའི་མདངས་ཕྱུང་ནས་ཀླུའི་རྒྱལ་པོ་བ་རུ་ཎ་སྦྲུལ་དཀར་པོ་གཅིག་ཏུ་བྱས་ནས་ཕྱག་འཚལ། བསྐོར་བ་ལན་གསུམ་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཅན། །ཁྱོད་ལ་བདག་ནི་སྐྱབས་སུ་མཆི། །
en: The nāga king Varuṇa became a single white snake, bowed down, circumambulated the bodhisattva three times, and said, “‘Compassionate bodhisattva, I take refuge in you.

source: ཀླུ་རྣམས་ཀུན་གྱི་མགོན་མཛོད་ཅིག །
en: Be the protector of all nāgas!

source: ཉམས་ན་ཀླུ་ཡི་གཤེད་མ་མཛོད། །
en: You may kill us if we commit an offense.’

source: ཅེས་སྨྲས་ནས་ཏྲི་ཤཱུ་ལ་ལ་ལན་གསུམ་དཀྲིས་ཁ་བྱང་ཆུབ་སེམས་དཔའ་ལ་བསྒྱུར་ཕུཿཕུཿཞེས་བརྗོད་ཅིང་གུས་པས་ཁ་ནས་ཁྲག་འབྱིན་ཅིང་གནས་སོ། །
en: “Saying this he wrapped himself around the trident three times, turned to face the bodhisattva, said, ‘phuḥ phuḥ!’ respectfully bled from his mouth, and remained there.

source: ཀླུའི་རྒྱལ་པོ་གཞན་རྣམས་ཀྱང་ཐལ་མོ་སྦྱར་ནས། བསྐོར་བ་ལན་གསུམ་གསུམ་བྱས་ནས། །བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཅན། །ཁྱོད་ལ་བདག་ཅག་སྐྱབས་སུ་མཆིའོ། །
en: “The other nāga kings likewise joined their palms, circumambulated him three times, and said, “‘Compassionate bodhisattva, We take refuge in you.

source: ཀླུ་རྣམས་ཐམས་ཅད་སྐྱབས་སུ་ཟུང་། །
en: Accept all nāgas under your protection!

source: ཅེས་སྨྲས་ནས་ཀླུ་ཆེན་པོ་བརྒྱད་སྦྲུལ་དཀར་པོ་གཅིག་ཏུ་བྱས་ནས་ཚངས་སྐུད་ལ་འཁྲིས་སོ། །
en: “Saying this, the eight great nāgas became a single white snake and bound themselves around him as a sacred thread.

source: ཀླུའི་རྒྱལ་པོ་དེ་རྣམས་ཀྱང་བདག་ཅག་ནི་བྲན་བགྱིད་དོ། །
en: Those nāga kings then said, ‘We are your servants.

source: ཅི་བཀའ་སྩལ་པ་ཉན་ནོ་ཞེས་སྨྲས་ནས་ཀླུ་རྣམས་སོ་སོའི་གནས་སུ་དེངས་སོ། །
en: We will listen to whatever you command.’ Then all the nāgas returned to their own places.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྙིང་རྗེ་ཀླུ་འདུལ་ཞེས་བྱའོ། །སྙིང་ནད་སེལ་བ་ཞེས་བྱ་བའོ། །
en: “Mañjuśrī, that bodhisattva then became known as Compassionate Nāga Tamer, and as Heart Disease Healer.

source: འཇམ་དཔལ་དེ་ལྟར་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཆེན་པོ་དེ་འཇམ་དཔལ་སྨྲ་བའི་སེང་གེ་ཁྱོད་ཉིད་ཡིན་ནོ། །
en: Mañjuśrī, indeed that bodhisattva Great Wisdom of former times is none other than you, Mañjuśrī Vādisiṃha.

source: དེའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་མཆོག་དེ་ནི་ད་ལྟའི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སེང་གེ་སྒྲ་ཀླུའི་དེད་དཔོན་ཆེན་པོ་འདི་ཉིད་ཡིན་ནོ། །
en: And the one who at that time was the bodhisattva Supreme Compassion is now Noble Avalokiteśvara Siṃhanāda, the great leader of the nāgas, himself.

source: འཇམ་དཔལ་ངས་རྒྱལ་པོ་ཆེན་པོ་དེའི་དོན་དུ་ཐུགས་རྗེ་ཆེན་པོའི་སྔགས་བརྗོད་པར་བྱའོ། །ཡིད་ལ་ཟུང་ཤིག །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱཱ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ། བོ་དྷི་ས་ཏྭཱ་ཡ། མ་ཧཱ་ས་དྭཱ་ཡ། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། ཏདྱ་ཐཱ།
en: Mañjuśrī, for the sake of the king I will pronounce the mantra of the Great Compassionate One—memorize it!

source: ཨོཾ་ཨ་ཀ་ཊེ་བི་ཀ་ཊེ། ནི་ཀ་ཊེ། ཀ་ཊཾ་ཀ་ཊེ་ཀ་རོ་ཊེ། ཙི་ཏི་ཛྭ་ལ་ཀ་རོ་ཏི་བཱི་ར་ཡེ་སྭཱ་ཧཱ། གཟུངས་འདི་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུས་གསུངས་ལ།
en: namo ratna­trayāya | nama āryāvalokiteśvarāya bodhi­sattvāya mahā­sattvāya mahā­kāruṇikāya | tadyathā| oṁ akaṭe vikaṭe nikaṭe kaṭaṃkaṭe karoṭe citijvala­karoṭavīrye svāhā || “This dhāraṇī has been taught by eight hundred million buddhas, and I myself pronounce it now.

source: ད་ལྟ་རང་ཉིད་ཀྱིས་བརྗོད་པའོ། །འདིའི་ཆོ་ག་ནི་མི་དགོས་པས་ལས་ཐམས་ཅད་འགྲུབ་པའོ། །
en: Its rite accomplishes all of the activities without need of great difficulty.

source: བཅོམ་ལྡན་འདས་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སེང་གེ་སྒྲའི་སྐུ་ལུགས་མའམ་བྲིས་སྐུའི་སྤྱན་སྔར་བའི་ལྕི་བ་ས་ལ་མ་ལྷུང་བས་སོ་སོར་མ་འདྲེས་པར་མཎྜལ་བརྒྱད་བྱས་ཏེ།
en: Before a statue or a painting of blessed Avalokiteśvara Siṃhanāda, make eight distinct maṇḍalas with cow dung that has not fallen to the ground.

source: མཎྜལ་རེ་རེ་ལ་མེ་ཏོག་ཚོམ་བུ་ལྔ་ལྔ་བཀྲམ་སྟེ། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་།
en: Scatter each maṇḍala with five bunches of flowers and make offerings of flowers, incense, perfumes, garlands, and scented powders.

source: ཕྲེང་བ་དང་། ཕྱེ་མ་རྣམས་ཀྱིས་མཆོད་ནས། མཎྜལ་རེ་རེ་ལ་གཟུངས་ལན་བཅུ་གསུམ་བཅུ་གསུམ་གྱི་བར་དུ་བཟླས་ལ་ལྕི་བ་དེ་བསྡུས་ཏེ།
en: Then recite the dhāraṇī thirteen times at each maṇḍala and gather the dung.

source: ལྕི་བ་ལྷག་མ་ལ་བསྔགས་ཤིང་ནད་པ་ལ་བྱུགས་ན་ནད་ཐམས་ཅད་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: Incant that resulting dung and anoint the sick person with it. All of their illnesses will be healed.

source: ལྷ་དང་ཀླུ་ལ་སོགས་པའི་དུག་གི་ནད་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །
en: All illnesses caused by the poison of gods, nāgas, and others will be healed.

source: ཞག་ཉི་ཤུ་རྩ་གཅིག་ལ་གྲུབ་པར་མ་གྱུར་ན། འཇམ་དཔལ་ཐུགས་རྗེ་ཆེན་པོ་ཉིད་ཀྱིས་མཚམས་མེད་པ་ལྔའི་ལས་བྱས་པ་ཡིན་ནོ། །
en: If it does not succeed within twenty-one days, then, Mañjuśrī, the Great Compassionate One himself, will have committed the five deeds with immediate retribution.

source: འཇམ་དཔལ་ཐུགས་རྗེ་ཆེན་པོ་ཉིད་ཀྱིས་དམ་བཅས་པའི་ཚིག་གོ། །
en: Mañjuśrī, this is the Great Compassionate One’s own promise.

source: འཇམ་དཔལ་རྒྱལ་པོ་ཆེན་པོའི་གནོད་པ་ནི་གཟུངས་འདིས་སྙིང་ནད་འབར་བ་ལས་གྲོལ་ནས་སྐྱེ་བ་ཕྱི་མ་ལ་བདེ་བ་ཅན་གྱི་ཞིང་ཁམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: Mañjuśrī, this dhāraṇī will free the great king from his ill health, the heart disease that afflicts him, and in his next life he will be reborn in the realm of Sukhāvatī.

source: འཇམ་དཔལ་ཉོན་ཅིག །
en: “Listen, Mañjuśrī!

source: སངས་རྒྱས་འོད་དཔག་མེད་ལ་སོགས་པ་སངས་རྒྱས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུས་སྙིང་པོ་འདི་གསུངས་སོ། །ཨོྃ་ཨཱཿཧྲཱིཿསིཾ་ཧ་ནཱ་ད་ཧཱུཾ་ཕཊ། ད་ལྟ་ང་ཉིད་ཀྱིས་བརྗོད་དེ། རིག་སྔགས་ཀྱི་སྙིང་པོ་འདི་ལན་ཅིག་བརྗོད་པས་སྡིག་པ་ཀུན་ལས་གྲོལ་བར་འགྱུར་རོ། །
en: The Buddha Amitābha and the rest of the nine-hundred ninety million buddhas have taught this essence mantra, and now I teach it: oṁ aḥ hrīḥ siṃhanāda hūṁ phaṭ || “Reciting this essence vidyāmantra just once frees the reciter from all evil deeds.

source: སྲིད་པ་ཉམ་ངར་འགྲོ་མི་འགྱུར། །ལུས་ལ་མཚོན་གྱིས་ཚུགས་མི་འགྱུར། །
en: “They will not take dreadful rebirths, Nor will their body be pierced by weapons.

source: དགྲ་དང་ཆོམ་པོས་མི་ཚུགས་ཤིང་། །ཀླུ་ལ་སོགས་པས་འཚེ་མི་འགྱུར། །
en: They will not be harmed by enemies or robbers, By nāgas, or by other such beings.

source: རྟག་ཏུ་དཔལ་དང་ལྡན་པར་འགྱུར། །བུད་མེད་ལུས་སུ་མི་འགྱུར་ཞིང་། །
en: They will always have fortune, And will not be born into a female body.

source: རྟག་ཏུ་སྐྱེ་བ་དྲན་པར་འགྱུར། །ཤི་ནས་བདེ་བ་ཅན་དུ་འགྲོ། །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་དང་། གཙུག་ཏོར་ཅན་དང་། ཐམས་ཅད་སྐྱོབ་དང་། ལོག་པར་དད་སེལ་དང་།
en: They will always remember their previous lives And at death will be reborn in Sukhāvatī.

source: གསེར་ཐུབ་དང་། འོད་སྲུང་གིས་ཀྱང་གསང་སྔགས་འདི་གསུངས་ལ། ད་ལྟ་ཤཱཀྱ་ཐུབ་པ་ངས་ཀྱང་བརྗོད་པ་སྟེ། ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མོ་ཧ་ཡ་གྲཱི་བཱ་ཡ། ན་མོ་ལོ་ཀི་ཤྭ་རཱ་ཡ། ཏདྱ་ཐཱ། ཨོྃ་ཧྲཱིཿཀུ་ལུ་ཡུ་ལུ་ནཱི་ལ་ཀདྛ། ཧུ་ལུ་ཧུ་ལུ། ཏིཥྛ་ཏིཥྛ།
en: “Mañjuśrī, the tathāgatas Vipaśyin, Śikhin, Viśvabhū, Krakucchanda, Kanakamuni, and Kāśyapa have all taught this mantra, and now I, Śākyamuni, teach it as well.

source: བན་དྷ་བན་དྷ། མཱ་ར་ཡ་མཱ་ར་ཡ། ཧཱ་ཧཱ་ཧཱ་ཧཱ། བཛྲ་ཀྲོ་དྷ་ཧ་ཡ་གྲཱི་བ་ཧྲཱིཿཧཱུྃ་ཕཊ། འཇམ་དཔལ་གཟུངས་འདི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཉིད་པདྨ་ཧ་ཡ་གྲཱི་བའི་སྔགས་ཡིན་ཏེ།
en: namo ratna trayāya | namo hayagrīvāya | namo lokesvarāya | tadyathā |oṁ hrīḥ kulu yulu nīlakaṇṭha hulu hulu tiṣṭha tiṣṭha bandha bandha māraya māraya hā hā hā hā vajrakrodha hayagrīva hṛīḥ hūṁ phaṭ || “Mañjuśrī, this dhāraṇī is the mantra of Padma Hayagrīva, who is Avalokiteśvara himself.

source: ལན་ཅིག་ཀློག་པར་བྱེད་པའི་མི། །སྡིག་པ་ཀུན་ལས་གྲོལ་འགྱུར་ཞིང་། །
en: “A person who recites this just once Will be freed from all evil deeds.

source: ངན་སོང་སྒོ་རྣམས་གཅོད་པར་འགྱུར། །ཀླུ་སོགས་གདོན་གྱིས་འཚེ་མི་འགྱུར། །
en: The doors to the lower realms will be cut off And they will be unharmed by grahas such as nāgas and the like.

source: བྱད་དང་དུག་ལས་གྲོལ་འགྱུར་ཞིང་། །སངས་རྒྱས་ཀུན་གྱི་གསུང་ཡིན་ནོ། །
en: They will be freed from kākhordas and poisoning— All the buddhas have taught this.

source: བྱེ་བ་གྲངས་མེད་མཐུ་ལས་བྱུང་། །དེ་ཡི་ཡོན་ཏན་དཔག་ཏུ་མེད། །
en: “Arisen through the power of countless billions, Its qualities are immeasurable.

source: ལན་ཅིག་བཀླགས་ན་སྡིག་པ་སེལ། །ལན་གཉིས་བཀླགས་པས་དཔལ་དང་ལྡན། །གསུམ་གྱིས་ཚེ་རྣམས་རིང་བར་འགྱུར། །
en: Speaking it once clears away evil deeds, Speaking it twice brings fortune, And three times brings long life.

source: འབུམ་ཕྲག་བཅུ་ཡིས་ཞལ་མཐོང་འགྱུར། །པདྨ་ཅན་གྱི་ཞིང་དེར་འགྲོ། །
en: After a million recitations, one will see his face And travel to the Lotus Realm.

source: འཇམ་དཔལ་མི་གཞན་དག་ལ་ནི། །ཁྲག་དང་མཁྲིས་པ་ལས་གྱུར་པ་དང་། །རླུང་དང་གྲང་བ་ལས་གྱུར་པ་དང་། །ཀླུ་རྒྱལ་རིགས་ཀྱིས་ཟིན་པ་དང་། །ཀླུ་བྲམ་ཟེའི་རིགས་ཀྱིས་ཟིན་པ་དང་། ཀླུ་གདོལ་པ་དང་ད་མངས་རིགས་ཀྱིས་ཟིན་པ་ནི་སྙིང་མི་དགའ་བ་དང་།
en: “Mañjuśrī, other people are afflicted by illnesses of blood or bile, sicknesses of wind or cold, or are afflicted by kṣatriya nāgas, brahmin nāgas, and outcaste or śūdra nāgas.

source: སྙིང་ན་བ་དང་། དབུགས་མི་བདེ་བ་དང་། ལྟོ་རྒྱབ་ཏུ་ན་བ་དང་། ཀླད་ཀོར་དུ་ན་བ་དང་། གཞོགས་ཕྱེད་ན་བ་དང་། མ་ཞུ་བ་དང་། སྦོས་པ་དང་། ཞ་གྲུམ་གྱིས་བཏབ་པ་དང་། སྦྲུམ་པ་ལྟ་བུར་ན་བ་དང་། སྲོག་ཆགས་སུ་ན་བ་དང་། ཚིགས་དང་ཤ་ཁོལ་བུར་ན་བ་དང་། ཟ་ཁུ་ཅན་དང་། ལུད་པ་གློ་ཅན་དང་། རུས་ཁོལ་དུ་ན་བ་དང་། འཕྲེས་པ་དང་། ཞ་བ་དང་། ཡིག་མི་བདེ་བ་དང་། ཐོར་པ་ལྟ་བུའི་ནད་དང་། སྐྲན་ཅན་དང་། དམུ་ཆུ་ཅན་དང་། འབྲས་དང་། མེ་དཔལ་དང་།
en: Therefore, they have joyless, ill hearts; they have difficulty breathing, their stomachs and backs ache, their heads ache, they have headaches on one side, indigestion, swelling, crippled limbs, pregnancy-related illnesses, animal-related illnesses, fractures of their joints and skin, urinary diseases, phlegmy coughs, and fractured bones.

source: ལྷོག་པ་དང་། གག་པ་དང་། ཆུ་ཐིག་ཅན་དང་། གྲང་ལྷང་ལྷང་དང་། ཚ་ཙག་ཙག་ལ་སོགས་པའི་མཛེ་རིགས་ཅན་དང་། ཕོལ་མིག་དང་བཅས་པ་དང་། ལྷ་དང་། བདུད་དང་། ཚངས་པ་དང་། གཤིན་རྗེ་དང་།
en: They stoop, are crippled, have a weak appetite, have skin pustules, tumors, edema, blisters, rashes, abscesses, swollen and blocked throats, gout, persisting sensations of cold, heat, and so on.

source: བྲག་སྲིན་དང་། སེམས་འཁྲུག་གི་གདོན་དང་། ཐབ་གཞོབ་དང་། མཚོ་སྨན་དང་། ཀླུ་ལ་སོགས་པས་ཟིན་པ་དང་། གནོད་སྦྱིན་དང་།
en: They are as if afflicted by different kinds of leprosy and boils; they are afflicted by gods, māras, brahmas, yamas, rock spirits, graha that disturb their mental state, angered hearth spirits, lake goddesses, nāgas or the like; they have been made ill by yakṣas, bhūtas, vināyakas, or flesh-eating graha; and they become ill in one of the myriad ways.

source: འབྱུང་པོ་དང་། ལོག་འདྲེན་དང་། ཤ་ཟའི་གདོན་རྣམས་ཀྱིས་ཟིན་པ་དང་། ནད་སྣ་ཚོགས་འབྱུང་སྟེ། དེ་ཡང་མི་དགེ་བ་ལས་སྡུག་བསྔལ་འབྱུང་བ་ཡིན་ནོ། །
en: All of this is suffering born from nonvirtue.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་ཉོན་ཅིག །སྙིང་པོ་གཟུངས་ཀྱི་ཆོ་ག་འདི། །
en: The Blessed One said, “O bodhisattva great being Mañjuśrī, listen!

source: དང་པོ་ཐུགས་རྗེ་ཆེན་པོ་ལ། །གུས་ཤིང་དད་པའི་སེམས་བསྐྱེད་ནས། །སྣུམ་པའི་ས་ལ་དཀྱིལ་འཁོར་བྱ། །ལྕི་བ་དྲིར་བཅས་བྱུགས་ནས་ནི། །ཚོན་རྩི་ཁ་དོག་སྣ་ལྔ་ཡིས། །
en: “This is the rite for this essence dhāraṇī: First arouse respect and faith For the Great Compassionate One And make a maṇḍala on fertile earth, Spread fragrant cow dung, And draw a lotus maṇḍala Using five colors of paint.

source: དཀྱིལ་འཁོར་པདྨ་ལྟ་བུ་བྲི། །བུམ་པ་གང་བ་ལྔ་དག་ཀྱང་། །ཕྱོགས་བཞི་དབུས་དང་ལྔ་རུ་གཞག །
en: “Place five full vases In the four directions and in the center, And arrange five abundant oblations.

source: གང་བའི་གཏོར་མ་ལྔ་ཡང་བཤམས། །སེང་ལྡེང་ཕུར་བུ་ལྔ་ཡང་དགོད། །དར་གྱིས་དཀྲིས་པའི་མདའ་བཞི་དགོད། །ཚོན་སྐུད་ལྔ་ཡི་དྲ་བ་བྲེ། །
en: Set five rosewood daggers, As well as four arrows tied with silk, And tie a lattice made of five-colored threads.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སེང་གེ་སྒྲ་ལ་ཕྱག་འཚལ་ལོ། །
en: “‘Homage to noble Avalokiteśvara Siṃhanāda.

source: ཁྲོ་བོའི་རྒྱལ་པོ་རྟ་མགྲིན་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the wrathful King Hayagrīva.

source: བཅོམ་ལྡན་འདས་མ་གོས་དཀར་མོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the blessed Pāṇḍaravāsinī.

source: བཅོམ་ལྡན་འདས་མ་སྒྲོལ་མ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the blessed Tārā.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀླུའི་རྒྱལ་པོ་བ་རུ་ཎ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the bodhisattva nāga king Varuṇa.

source: ཨཱ་ཧྲཱིཿཧྲི་པྃ་རྟྃ་ནོྃ། ཡི་གེ་དྲུག་པའི་སྔགས་འདི་ནི། བརྗོད་པས་སྡིག་པ་སྡུག་བསྔལ་སེལ་སྭཱ་ཧཱ།
en: ā hrīḥ hri paṁ taṁ naṁ || “‘Through the recitation of this six-syllabled mantra May all evil deeds be cleared away svāhā.’

source: སངས་རྒྱས་མཆོད་ལ་བརྩོན་པར་བྱ། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་གི་ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: “One should exert oneself in worshiping the buddhas using offerings of flowers, incense, perfumes, flower garlands, scented unguents, parasols, banners, pendants, scented powders, and all sorts of ornaments.

source: བ་དན་དང་། ཕྱེ་མ་དང་། རྒྱན་ཐམས་ཅད་ཀྱིས་མཆོད་ནས། སེང་ལྡེང་རྒྱ་ཤུག་མེ་བཏང་ལ། །ཚོན་སྐུད་བཅང་ཞིང་འབྲུ་རྣམས་བསྲེག །
en: “Then make a fire with rosewood and jujube, Hold the colored threads and burn grains.

source: རྨ་བྱ་རྨག་ཤད་ལྕུག་མ་ཡིས། །ཀླུ་ཡི་དུག་རྣམས་སེལ་བར་བྱེད། །ཧྲཱིཿནཱ་ག་ལེ་ལེ། ནཱ་ག་དུམ་བ་ལེ་ལེ།
en: Using a peacock feather and a spiraea sprig, Clear away the nāga poison.

source: ནཱ་ག་ཕུཏ་ཕུཏ་ཧ་ལེ་ཧ་ལེ། ཧཱ་ལ་ཧཱ་ལ། སྥུ་ཊ་སྥུ་ཊ། ནཱ་ག་ཁྲོལ་ཁྲོལ་ཤིག་ཤིག་སྭཱ་ཧཱ། ཀླུ་དང་ལོག་འདྲེན་ཐམས་ཅད་ཀྱི་ཡིད་ཀྱི་དུག་དང་། མཐོང་བའི་དུག་དང་།
en: hrīḥ nāga lele nāga dumva lele nāga phut phut hale hale hāla hāla sphuṭa sphuṭanāga bright flickeringsvāhā || “‘May the poison from the minds of all nāgas and vināyakas, the poison from seeing them, the poison from binding them, the poison from their breath, the poison from touching them, and all poison be expelled svāhā!

source: བཅིངས་པའི་དུག་དང་། ཁ་རླངས་ཀྱི་དུག་དང་། རེག་པའི་དུག་དང་། དུག་ཐམས་ཅད་ཕྱིར་ཕུད་ཅིག་སྭཱ་ཧཱ། དུག་འདིར་མ་འདུག་ཅིག །
en: “‘May the poison not remain here!

source: སྦྱིན་པར་བྱེད་པའི་གན་དུ་སོང་ཤིག །
en: May it be drawn into this gift!

source: འཛིན་པའི་གན་དུ་སོང་ཤིག །
en: May it be drawn into what is held!

source: མེའི་ནང་དུ་སོང་ཤིག །
en: May it depart into the fire!

source: ཆུའི་ནང་དུ་སོང་ཤིག་ཞི་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: May it depart into the water! May it be pacified svāhā!’

source: འཇམ་དཔལ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའོ། །ཧྲིཿབྲུྃ་ཨོཾ་ཧཱུྃ་ཁྃ། རིགས་ལྔས་དབང་བསྐུར་བའོ། །
en: “Mañjuśrī, here are the initiations bestowed by the tathāgatas from their crown: hriḥ bruṁ oṁ hūṁ khaṁ || “The five families confer empowerment.

source: རྡོ་རྗེ་བསྲུང་བའི་མཆོག་ཏུ་འགྱུར། །བཀྲ་ཤིས་ལྷ་མོ་དཔལ་དང་ལྡན། །བསྙེན་གནས་ལ་ནི་གནས་གྱུར་ནས། །དཀོན་མཆོག་རྗེས་དྲན་སེམས་བསྐྱེད་ནས། །བུམ་ཆུ་དག་པས་ལས་སྒྲིབ་སེལ། །ལུས་ངག་སེམས་ཀྱི་དག་པ་ཐོབ། །
en: “One who has the supreme vajra protection, The favor of the auspicious goddess, And maintains a fast, Recalls the Three Jewels, arouses bodhicitta, Clears their karmic obscurations with the vase’s pure water, And obtains purity of body, speech, and mind.

source: ཕ་རོལ་ཕྱིན་དྲུག་གནས་འགྱུར་ཞིང་། །སངས་རྒྱས་སེམས་ཅན་མཁྱེན་པར་འགྱུར། །ཏིང་འཛིན་ཐམས་ཅད་མངོན་དུ་འགྱུར། །
en: They are suffused with the six perfections, Come to know buddhas and beings, And all samādhis become manifest.

source: བུ་མོ་གཞོན་ནུས་བཀལ་བ་ཡི། །སྐུད་པ་དཀར་པོ་སུམ་སྒྲིལ་ལ། །བཟླས་བརྗོད་ཉི་ཤུ་བརྒྱད་བྱས་ནས། །
en: “Weave together three white threads Spun by a young maiden And incant it twenty-eight times.

source: མགུལ་དུ་བཏགས་ན་ནད་ལས་གྲོལ། །
en: When it is worn around the neck, one will be free of illness.

source: ནད་ལ་ཕན་པའི་སྨན་རྣམས་ལ། །གཟུངས་སྔགས་བཟླས་ཤིང་བཏབ་གྱུར་ན། །ནད་རྣམས་ཀུན་ལས་གྲོལ་བར་འགྱུར། །
en: “If this dhāraṇīmantra is used to incant Medicines used to heal illness, The medicine heals all illnesses when given.

source: ཆུ་ལ་གཟུངས་སྔགས་མང་བཟླས་ན། །ཀླུ་ནད་ཁོང་དུ་སེལ་བར་འགྱུར། །
en: “When recited many times over water The dhāraṇīmantra heals nāga illnesses from within.

source: ལོ་ཏོག་ཟ་བ་ཁ་བཅིངས་ན། །བྱེ་མ་ས་དང་ཐལ་བས་སེལ། །
en: “If something is devouring the harvest, This can be remedied with powders, earth, and ashes.

source: ཧ་ཅང་ཆར་པ་ཆེས་པ་ན། །ལྷ་ལ་ཕུལ་བའི་རྙིང་པ་ལ། །ཁམ་ཕོར་སར་པའི་ནང་དུ་ཡང་། །མེ་ཏོག་གཙང་མ་བླངས་ནས་ནི། །བསྲེགས་ན་ཆར་པ་འཆད་པར་འགྱུར། །
en: “If there is too much rain, Burn freshly picked flowers Inside a new vessel At an ancient shrine, And the rain will stop.
